; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l8_p8_c8_g8)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 - location
	box1 box2 box3 box4 box5 box6 box7 box8 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 medicina)
	(at-box box5 deposito)
	(box-has box5 medicina)
	(at-box box6 deposito)
	(box-has box6 medicina)
	(at-box box7 deposito)
	(box-has box7 medicina)
	(at-box box8 deposito)
	(box-has box8 medicina)
	(at-person person1 refugio6)
	(at-person person2 refugio1)
	(at-person person3 refugio8)
	(at-person person4 refugio7)
	(at-person person5 refugio4)
	(at-person person6 refugio7)
	(at-person person7 refugio5)
	(at-person person8 refugio6)
)

(:goal (and
	(person-has person1 comida)
	(person-has person2 medicina)
	(person-has person4 medicina)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person6 medicina)
	(person-has person8 comida)
	(person-has person8 medicina)
))
)

; plan
1. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 0 of 8
2. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 0 of 8
3. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 0 of 8
4. (leave box8 refugio1 dron1-izq dron1 person2 medicina)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 medicina)
   added: (at-box box8 refugio1) (free dron1-izq) (person-has person2 medicina)
   goals met: 1 of 8
5. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 1 of 8
6. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 1 of 8
7. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 1 of 8
8. (leave box7 refugio4 dron1-izq dron1 person5 medicina)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 medicina)
   added: (at-box box7 refugio4) (free dron1-izq) (person-has person5 medicina)
   goals met: 2 of 8
9. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 2 of 8
10. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 2 of 8
11. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 2 of 8
12. (leave box6 refugio7 dron1-izq dron1 person4 medicina)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 medicina)
   added: (at-box box6 refugio7) (free dron1-izq) (person-has person4 medicina)
   goals met: 3 of 8
13. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 3 of 8
14. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 3 of 8
15. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 3 of 8
16. (leave box3 refugio7 dron1-der dron1 person6 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio7) (free dron1-der) (person-has person6 comida)
   goals met: 4 of 8
17. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 4 of 8
18. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 4 of 8
19. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 4 of 8
20. (leave box5 refugio7 dron1-izq dron1 person6 medicina)
   deleted: (carrying dron1 dron1-izq box5) (box-has box5 medicina)
   added: (at-box box5 refugio7) (free dron1-izq) (person-has person6 medicina)
   goals met: 5 of 8
21. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 5 of 8
22. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 5 of 8
23. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 5 of 8
24. (leave box4 refugio6 dron1-izq dron1 person8 medicina)
   deleted: (carrying dron1 dron1-izq box4) (box-has box4 medicina)
   added: (at-box box4 refugio6) (free dron1-izq) (person-has person8 medicina)
   goals met: 6 of 8
25. (leave box2 refugio6 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio6) (free dron1-der) (person-has person1 comida)
   goals met: 7 of 8
26. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 7 of 8
27. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 7 of 8
28. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 7 of 8
29. (leave box1 refugio6 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio6) (free dron1-der) (person-has person8 comida)
   goals met: 8 of 8
